=============================
Req/rep detailed informations
=============================


clients.list.get
================

Request : UIs
Reply : manager

To get the clients list, the UI may send a MQ request *clients.list.get* to the manager.

The UI may use this MQ request only on startup or when it needs to initiate the values. To get updates, the UI should subscribe to the appropriate MQ publisher : *clients.list*.

An example to send the request is available as *src/domogik/examples/mq-python/req_clients_list.py*.

You will get a reply like this: ::

    ['clients.list.result', '{"domogik-diskfree.darkstar": {"status": "unknown", "name": "diskfree", "configured": true, "pid": 0, "host": "darkstar", "package_id": "plugin-diskfree", "type": "plugin"}}']



clients.detail.get
==================

Request : UIs
Reply : manager

To get the clients detail, the UI may send a MQ request *clients.detail.get* to the manager.

The UI may use this MQ request only on startup or when it needs to initiate the values. To get updates, the UI should subscribe to the appropriate MQ publisher : *clients.detail*.

An example to send the request is available as *src/domogik/examples/mq-python/req_clients_detail.py*.

You will get a reply like this: ::

    ['clients.detail.result', '{"domogik-diskfree.darkstar": {"status": "unknown", "name": "diskfree", "data": {"configuration": [{"description": "Automatically start plugin at Domogik startup", "default": false, "required": false, "options": [], "key": "startup-plugin", "type": "boolean", "id": "0"}, {"description": "Interval between each poll (minute)", "default": 5, "required": false, "value": "7", "options": [], "key": "interval", "type": "integer", "id": "1"}]}, "configured": true, "pid": 0, "package_id": "plugin-diskfree", "host": "darkstar", "type": "plugin"}}']


config.get
==========

Request : Plugins, UIs
Reply : dbmgr

To get *one* configuration elements, the clients may send a MQ request *config.get* to the dbmgr: ::

    request : config.get
    data : type = plugin
           id = <plugin id>
           host = <hostname>
           key = <configuration key>

An example to send the request is available as *src/domogik/examples/mq-python/req_config_get.py*.

You will get a reply like this: ::

    ['config.result', '{"status": true, "reason": "", "value": 5, "host": "darkstar", "key": "interval", "type": "plugin", "id": "diskfree"}']

To get *all* configuration elements for a plugin, you can use the same MQ request without the *key* element. 
ll the values will be returned as a json dictionnary in the *data* key :

    request : config.get
    data : type = plugin
           id = <plugin id>
           host = <hostname>

An example to send the request is available as *src/domogik/examples/mq-python/req_config_get_all.py*.

You will get a reply like this: ::

    ['config.result', '{"status": true, "type": "plugin", "reason": "", "host": "darkstar", "key": "*", "data": {"interval": 5, "configured": true, ....}, "id": "diskfree"}']


config.set
==========

Request : UIs
Reply : dbmgr

To set values the configuration elements, the UI may send a MQ request *config.set* to the dbmgr: ::

    request : config.set
    data : type = plugin
           id = <plugin id>
           host = <hostname>
           data = <dictionnary : { 'key1' : 'value1', 'key2' : 'value2', ....} >

Notice that a 'configured' key (value = True) will be silently added as configuration element : it indicates that the plugin has been configured and is used by the plugins and the UIs.

An example to send the request is available as *src/domogik/examples/mq-python/req_config_set.py*.

You will get a reply like this: ::

    ['config.result', '{"status": true, "reason": "", "type": "plugin", "host": "darkstar", "id": "diskfree"}']


config.delete
=============

Request : UIs
Reply : dbmgr

To delete all the values for a type/id/host configuration elements, the UI may send a MQ request *config.delete* to the dbmgr: ::

    request : config.delete
    data : type = plugin
           id = <plugin id>
           host = <hostname>

An example to send the request is available as *src/domogik/examples/mq-python/req_config_delete.py*.

You will get a reply like this: ::

    ['config.result', '{"status": true, "reason": "", "type": "plugin", "host": "darkstar", "id": "diskfree"}']


packages.detail.get
===================

TODO

plugin.start.do
===============

Request : UIs
Reply : manager

To request a plugin to start, the UI may send a MQ request *plugin.start.do* to the manager: ::

    request : plugin.start.do
    data : id = <plugin id : ipx800, 1wire, ...>

To get updates on the plugin status after the request, the UI should subscribe to the appropriate MQ publisher : *plugin.status*.

An example to send the request is available as *src/domogik/examples/mq-python/req_plugin_start.py*.

You will get a reply like this: ::

    ['plugin.start.result', '{"status": true, "reason": "", "host": "darkstar", "key": "startup", "type": "plugin", "id": "diskfree"}']



plugin.stop.do
===============

Request : UIs
Reply : the plugin to stop

To request a plugin to stop, the UI may send a MQ request *plugin.start.do* to the plugin: ::

    request : plugin.stop.do
    data : id = <plugin id : ipx800, 1wire, ...>

To get updates on the plugin status after the request, the UI should subscribe to the appropriate MQ publisher : *plugin.status*.

An example to send the request is available as *src/domogik/examples/mq-python/req_plugin_stop.py*.

You will get a reply like this: ::

    ['plugin.stop.result', '{"status": true, "reason": "", "host": "darkstar", "key": "configured", "type": "plugin", "id": "diskfree"}']




