Repository: AnisJomni/domogik
Catalog: src/domogik/admin/translations/*/LC_MESSAGES/messages.po
Languages: nl_be

source: Configuration
nl_be: Configuratie

source: Detected devices
nl_be: Gedetecteerde toestellen

source: Create a new device
nl_be: Maak een nieuwe toestel aan

source: Create by product
nl_be: Voeg toe op basis van product

source: Create by device type
nl_be: Voeg toe op basis van toetel type

source: No device types found
nl_be: Geen toestel types gevonden

source: Known Devices
nl_be: Gekende toestellen

source: Name
nl_be: Naam

source: Device Type
nl_be: Toestel Type

source: Description
nl_be: Omschrijving

source: Delete
nl_be: Verwijder

source: Sensors
nl_be: Sensor

source: Last value
nl_be: Laatste waarde

source: Last received
nl_be: Laatst ontvangen

source: Commands
nl_be: Commando

source: Params
nl_be: Parameters

source: No devices found
nl_be: Geen toestel gevonden

source: Client
nl_be: Clients

source: Config
nl_be: Configuratie

source: Devices
nl_be: Toestellen

source: Known
nl_be: Gekend

source: Detected
nl_be: Gedetecteerd

source: New
nl_be: Nieuw

source: Client list
nl_be: Client lijst

source: Configured
nl_be: Geconfigureerd

source: No clients found
nl_be: Geen clients gevonden

source: Orphan Devices
nl_be: Wees toestellen

source: Hooray, no orphans found
nl_be: Hoera, geen wezen gevonden

source: Orphans
nl_be: Wezen

source: Config saved successfull
nl_be: Config opgeslagen

source: Config saved failed
nl_be: Config opslaan gefaald

source: DbMgr did not respond on the config.set, check the logs
nl_be: DbMgr reageert niet op een config.set commando. Bekijk de log files.

source: the display name for this device
nl_be: De getoonde naam van het toestel

source: A description for this device
nl_be: Een omschrijving van het toestel

source: A reference for this device
nl_be: Een referentie voor dit toestel

source: Device creation failed
nl_be: Toestel aanmaken is gefaald

source: Can not find this client id
nl_be: Kan deze client-id niet vinden

source: device created
nl_be: Toestel aangemaakt

source: Login successfull
nl_be: Inloggen geslaagd

source: This user is not an admin
nl_be: De gebruiker is geen admin

source: Combination of username and password wrong
nl_be: De combinatie van gebruiksnaam en paswoord is verkeerd

source: Device deleted
nl_be: Toestel verwijderd
